# running in free_list/src/
read -formal free_list.v
prep -top free_list

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
